OdDAI.Anchor.getTypedValue(OdDAI.Binary*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the Binary value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to Binary, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new Binary value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdDAI.Number*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the Number value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to Number, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAI.Number!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new Number value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdDAI.EnumValueInfo*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the EnumValueInfo value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to EnumValueInfo, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAI.EnumValueInfo!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new EnumValueInfo value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdDAI.AttributeDataBlock*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the AttributeDataBlock value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to AttributeDataBlock, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new AttributeDataBlock value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdDAI.Aggr*)
\details
Retrieves the Aggr* value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to Aggr*, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAI.Aggr!System.Runtime.CompilerServices.IsConst*)
\details
Sets new Aggr* value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdDAIObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the OdDAIObjectId value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to OdDAIObjectId, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new OdDAIObjectId value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the OdAnsiString value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to OdAnsiString, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new OdAnsiString value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdDAI.Logical*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the Logical value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to Logical, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new Logical value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(OdDAI.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the Boolean value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to Boolean, otherwise return fasle.

OdDAI.Anchor.setTypedValue(OdDAI.Boolean!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets new Boolean value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the double value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to double, otherwise return fasle.

OdDAI.Anchor.setTypedValue(System.Double)
\details
Sets new double value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor.getTypedValue(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the integer value of Anchor instance.
\param valueToGet [out] retrieved value.
\returns true if anchor value can converts to integer, otherwise return fasle.

OdDAI.Anchor.setTypedValue(System.Int32)
\details
Sets new integer value for the Anchor instance.
\param newValue [in] settled value.

OdDAI.Anchor
\details
The class that implements an anchor object.